#+title: Evaluación de la exposición
#+author: Gunnar Wolf

* Memoria virtual, archivos de paginación y área swap

- Tema presentado por :: Luis Angel Echevarría y Angel Tapia
- Calificación global :: 9.13

|------------------------+------+--------------------+------+---------|
| Evaluación  compañeros | Peso | Evaluación docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                   9.13 |  0.3 |               9.13 |  0.7 |    9.13 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Evaluación grupal

|              | 1 | 2 | 3 | 4 | 5 | Total |
|--------------+---+---+---+---+---+-------|
| Originalidad | 0 | 0 | 0 | 2 | 4 |  9.33 |
| Nivel        | 0 | 0 | 1 | 1 | 4 |  9.00 |
| Relevancia   | 0 | 0 | 0 | 2 | 4 |  9.33 |
| Claridad     | 0 | 0 | 1 | 1 | 4 |  9.00 |
| Presencia    | 0 | 0 | 0 | 3 | 3 |  9.00 |
|--------------+---+---+---+---+---+-------|
|              |   |   |   |   |   |  9.13 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compañeros
- Muy bien :)
- La presentación me gusto al igual que las diapositivas, sólo recomiendo
  no poner tanto texto en ellas y hablar un poquito más despacio.
- Ninguno.

* Evaluación por parte del docente

| *Aspecto*              | *Peso* | *Evaluación* | *Puntos* |
|------------------------+--------+--------------+----------|
| Originalidad del tema  |    0.1 |           10 |       1. |
| Material desarrollado  |    0.2 |          7.5 |      1.5 |
| Contenido              |    0.2 |           10 |       2. |
| Fuentes bibliográficas |    0.1 |           10 |       1. |
| Uso del tiempo         |    0.1 |           10 |       1. |
| Dominio del tema       |   0.15 |          7.5 |    1.125 |
| Presencia              |   0.15 |           10 |      1.5 |
|------------------------+--------+--------------+----------|
| *Global*               |        |              |     9.13 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios
- La presentación me pareció buena, con buena profundidad. Pero sí dejo el
  comentario de que tenemos que intentar orientarlas al /cómo/ más que al
  /qué/. Presentaron /enunciativamente/ muchos conceptos, que seguramente
  ayudarán cuando veamos formalmente este tema en clase, pero le parece que
  le falta un poquito de "enganche técnico".

  La presentación tiene demasiado texto en pantalla, y eso hace que el
  público se /aburra/ un poco. Intenten usar menos texto por lámina en sus
  presentaciones.

- El uso de memoria virtual no es mágico. Los problemas de procesos
  demasiado grandes /siguen/ ocurriendo, /aunque menos/. En particular, no
  resuelve el problemas de la /pantalla azul/: Windows _necesariamente
  opera siempre_ con memoria virtual. Muchas pantallas azules (me atrevo a
  decir que la mayoría) son debido a /errores/ en el manejo de la memoria
  virtual.
- *¡AYYYYYYYYY Mis pobres ojos!*

  En la lámina que comienza a hablar de "cifrado de datos en partición
  swap", hay un título.... "/Combeniente/". ¡Tengo que revisar que no me
  estén sangrando! :-(

- Cuando mencionan "swap distribuida", es importante considerar que _no_
  mejora la estabilidad: Cualquier fallo en un dispositivo que contenga
  parte de la memoria virtual /debe ser manejado como un error
  catastrófico/ para el sistema operativo (esto es, el sistema tiene la
  _obligación_ de /morirse/, como con una "pantalla azul"). Si pierdes
  parte del contenido de la memoria principal, el SO no puede continuar
  operando.


